Revit 2018 API
View.HideElementsTemporary Method
 Set multiple elements to be temporarily hidden in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2013
Syntax
C#
public void HideElementsTemporary(
	ICollection<ElementId> elementIdSet
)
Visual Basic
Public Sub HideElementsTemporary ( _
	elementIdSet As ICollection(Of ElementId) _
)
Visual C++
public:
void HideElementsTemporary(
	ICollection<ElementId^>^ elementIdSet
)
Parameters
elementIdSet
Type: System.Collections.Generic.ICollection<ElementId>
 Ids of the elements to be temporarily hidden.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
View Class
Autodesk.Revit.DB Namespace